content/notes/20240330-raschka-torch-notes.org
#+title: PyTorch Review
#+date:      <2024-03-31 Sun>
#+filetags:   :ai:deeplearning:python:pytorch:
#+identifier: 20240330T102821

#+begin_preview
This is a quick run through the appendix on PyTorch from Sebastian Raschka's [[https://www.manning.com/books/build-a-large-language-model-from-scratch][Build a Large Language Model (From Scratch)]] book, currently available via Manning's MEAP. I haven't spent an enormous amount of time with PyTorch in the last year or so, so it seemed worth the effort to work through it.
#+end_preview

* A.1 PyTorch
There are three broad components to PyTorch:
- A tensor library extending array-oriented programming from NumPy with additional features for accelerated computation on GPUs.
- An automatic differentiation engine (autograd), which ehables automatic computation of gradients for tensor operations for backpropagation/model optimization.
- A deep learning library, offering modular, flexible, and extensible building blocks for designing and training deep learning models.

Let's make sure we have it installed correctly...

#+begin_src python :session appA
import torch

torch.__version__
#+end_src

#+RESULTS:
: 2.2.2

Let's make sure we can use ~mps~ (on mac).

#+begin_src python :session appA
torch.backends.mps.is_available()
#+end_src

#+RESULTS:
: True

Great.
* A.2 Understanding tensors

Tensors generalize vectors and matrices to arbitrary dimensions. PyTorch tensors are similar to NumPy arrays but have have several additional features:
- an automatic differentiation engine
- gpu computation
Still, it has a numpy-like API.
** Creating tensors

#+begin_src python :session appA :results output
# 0d tensor (scalar)
print(torch.tensor(1))

# 1d tensor (vector)
print(torch.tensor([1, 2, 3]))

# 2d tensor
print(torch.tensor([[1, 2], [3, 4]]))

# 3d tensor
print(torch.tensor([[[1, 2], [3,4]], [[5,6], [7,8]]]))
#+end_src

#+RESULTS:
: tensor(1)
: tensor([1, 2, 3])
: tensor([[1, 2],
:         [3, 4]])
: tensor([[[1, 2],
:          [3, 4]],
: 
:         [[5, 6],
:          [7, 8]]])
** Tensor data types
These are important to pay attention to! So let's pay attention to them. The default (from above) is the 64-bit integer.

#+begin_src python :session appA :results output
tensor1d = torch.tensor([1,2,3])
print(tensor1d.dtype)
#+end_src

#+RESULTS:
: torch.int64

For floats, PyTorch uses 32-bit precision by default.


#+begin_src python :session appA :results output
floatvec = torch.tensor([1., 2., 3.])
print(floatvec.dtype)
#+end_src

#+RESULTS:
: torch.float32

Why this default?
- GPU architectures are optimized for 32-bit computations
- 32-bit precision is sufficient for most deep learning tasks but uses less memory and computational resources than 64-bit.

it is easy to change ~dtype~ (and precision) with a tensor's ~.to~ method.

#+begin_src python :session appA :results output
print(torch.tensor([1,2,3]).to(torch.float32).dtype)
#+end_src

#+RESULTS:
: torch.float32
** Common tensor operations
- brief survey of the most common tensor operations prior to getting into the computational graphs concept.


#+begin_src python :session appA :results output
tensor2d = torch.tensor([[1, 2, 3], [4, 5, 6]])
#+end_src

#+RESULTS:

Reshape:

#+begin_src python :session appA :results output
print(tensor2d.reshape(3, 2))
#+end_src

#+RESULTS:
: tensor([[1, 2],
:         [3, 4],
:         [5, 6]])

It is more common to use ~view~ than ~reshape~.

#+begin_src python :session appA :results output
print(tensor2d.view(3, 2))
#+end_src

#+RESULTS:
: tensor([[1, 2],
:         [3, 4],
:         [5, 6]])

Transpose

#+begin_src python :session appA :results output
print(tensor2d.T)
#+end_src

#+RESULTS:
: tensor([[1, 4],
:         [2, 5],
:         [3, 6]])


Matrix multiplication is usually handled with ~matmul~.

#+begin_src python :session appA :results output
print(tensor2d.matmul(tensor2d.T))
#+end_src

#+RESULTS:
: tensor([[14, 32],
:         [32, 77]])

#+begin_src python :session appA :results output
print(tensor2d @ tensor2d.T)
#+end_src

#+RESULTS:
: tensor([[14, 32],
:         [32, 77]])
