notes/20240330-raschka-torch-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PyTorch Review</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Roboto+Slab&display=swap" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
<div id="preamble" class="status">
<hr class="topnav-rule">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <nav class="topnav-links" aria-label="Primary">
    <a href="/archive.html">Blog</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/about.html">About Me</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/photos.html">Photos</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notebooks/">Notebooks</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notes.html">Notes</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a class="topnav-icon" href="/rss.xml" aria-label="RSS feed">
      <svg class="rss-icon" viewBox="0 0 24 24" aria-hidden="true" fill="none" stroke="currentColor" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round">
        <path d="M5 4h1a14 14 0 0 1 14 14v1"/>
        <path d="M5 11h1a7 7 0 0 1 7 7v1"/>
        <circle cx="6" cy="18" r="2"/>
      </svg>
    </a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <button id="theme-toggle" class="nav-theme-toggle topnav-icon" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </nav>
</header>
<hr class="topnav-rule">
</div>
<div id="content" class="content">
<header>
<h1 class="title">PyTorch Review</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga5a11d2">A.1 PyTorch</a></li>
<li><a href="#orgc1699d0">A.2 Understanding tensors</a>
<ul>
<li><a href="#orgb0bc8ee">Creating tensors</a></li>
<li><a href="#org064d1af">Tensor data types</a></li>
<li><a href="#org460589b">Common tensor operations</a></li>
</ul>
</li>
<li><a href="#org970cf37">A.3 Models as Computational Graphs</a></li>
<li><a href="#orge0faaad">A.4 Automatic Differentiation</a></li>
<li><a href="#orged4dbdc">A.5 Implementing multilayer neural networks</a></li>
<li><a href="#org49fd392">A.6 Setting up efficient data loaders</a></li>
<li><a href="#org1774662">A.7 A typical training loop</a></li>
<li><a href="#orge9a4fd2">A.8 Saving and Loading Models</a></li>
<li><a href="#org65e9781">A.9 Optimizing training performance with GPUs</a>
<ul>
<li><a href="#orgb42ad29">Computations on GPUs</a></li>
<li><a href="#org5db4616">Single-GPU Training</a></li>
<li><a href="#org8121414">Multi-GPU Training</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div class="preview" id="org7a6b6e0">
<p>
This is a quick run through the appendix on PyTorch from Sebastian Raschka's <a href="https://www.manning.com/books/build-a-large-language-model-from-scratch">Build a Large Language Model (From Scratch)</a> book, currently available via Manning's MEAP. I haven't spent an enormous amount of time with PyTorch in the last year or so, so it seemed worth the effort to work through it.
</p>

</div>

<div id="outline-container-orga5a11d2" class="outline-2">
<h2 id="orga5a11d2">A.1 PyTorch</h2>
<div class="outline-text-2" id="text-orga5a11d2">
<p>
There are three broad components to PyTorch:
</p>
<ul class="org-ul">
<li>A tensor library extending array-oriented programming from NumPy with additional features for accelerated computation on GPUs.</li>
<li>An automatic differentiation engine (autograd), which ehables automatic computation of gradients for tensor operations for backpropagation/model optimization.</li>
<li>A deep learning library, offering modular, flexible, and extensible building blocks for designing and training deep learning models.</li>
</ul>

<p>
Let's make sure we have it installed correctly&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> torch

torch.__version__
</pre>
</div>

<pre class="example">
2.2.2
</pre>


<p>
Let's make sure we can use <code>mps</code> (on mac).
</p>

<div class="org-src-container">
<pre class="src src-python">torch.backends.mps.is_available()
</pre>
</div>

<pre class="example">
True
</pre>


<p>
Great.
</p>
</div>
</div>
<div id="outline-container-orgc1699d0" class="outline-2">
<h2 id="orgc1699d0">A.2 Understanding tensors</h2>
<div class="outline-text-2" id="text-orgc1699d0">
<p>
Tensors generalize vectors and matrices to arbitrary dimensions. PyTorch tensors are similar to NumPy arrays but have have several additional features:
</p>
<ul class="org-ul">
<li>an automatic differentiation engine</li>
<li>gpu computation</li>
</ul>
<p>
Still, it has a numpy-like API.
</p>
</div>
<div id="outline-container-orgb0bc8ee" class="outline-3">
<h3 id="orgb0bc8ee">Creating tensors</h3>
<div class="outline-text-3" id="text-orgb0bc8ee">
<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">0d tensor (scalar)
</span><span class="org-builtin">print</span>(torch.tensor(1))

<span class="org-comment-delimiter"># </span><span class="org-comment">1d tensor (vector)
</span><span class="org-builtin">print</span>(torch.tensor([1, 2, 3]))

<span class="org-comment-delimiter"># </span><span class="org-comment">2d tensor
</span><span class="org-builtin">print</span>(torch.tensor([[1, 2], [3, 4]]))

<span class="org-comment-delimiter"># </span><span class="org-comment">3d tensor
</span><span class="org-builtin">print</span>(torch.tensor([[[1, 2], [3,4]], [[5,6], [7,8]]]))
</pre>
</div>

<pre class="example">
tensor(1)
tensor([1, 2, 3])
tensor([[1, 2],
        [3, 4]])
tensor([[[1, 2],
         [3, 4]],

        [[5, 6],
         [7, 8]]])
</pre>
</div>
</div>
<div id="outline-container-org064d1af" class="outline-3">
<h3 id="org064d1af">Tensor data types</h3>
<div class="outline-text-3" id="text-org064d1af">
<p>
These are important to pay attention to! So let's pay attention to them. The default (from above) is the 64-bit integer.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">tensor1d</span> <span class="org-operator">=</span> torch.tensor([1,2,3])
<span class="org-builtin">print</span>(tensor1d.dtype)
</pre>
</div>

<pre class="example">
torch.int64
</pre>


<p>
For floats, PyTorch uses 32-bit precision by default.
</p>


<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">floatvec</span> <span class="org-operator">=</span> torch.tensor([1., 2., 3.])
<span class="org-builtin">print</span>(floatvec.dtype)
</pre>
</div>

<pre class="example">
torch.float32
</pre>


<p>
Why this default?
</p>
<ul class="org-ul">
<li>GPU architectures are optimized for 32-bit computations</li>
<li>32-bit precision is sufficient for most deep learning tasks but uses less memory and computational resources than 64-bit.</li>
</ul>

<p>
it is easy to change <code>dtype</code> (and precision) with a tensor's <code>.to</code> method.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(torch.tensor([1,2,3]).to(torch.float32).dtype)
</pre>
</div>

<pre class="example">
torch.float32
</pre>
</div>
</div>
<div id="outline-container-org460589b" class="outline-3">
<h3 id="org460589b">Common tensor operations</h3>
<div class="outline-text-3" id="text-org460589b">
<ul class="org-ul">
<li>brief survey of the most common tensor operations prior to getting into the computational graphs concept.</li>
</ul>


<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">tensor2d</span> <span class="org-operator">=</span> torch.tensor([[1, 2, 3], [4, 5, 6]])
</pre>
</div>

<p>
Reshape:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(tensor2d.reshape(3, 2))
</pre>
</div>

<pre class="example">
tensor([[1, 2],
        [3, 4],
        [5, 6]])
</pre>


<p>
It is more common to use <code>view</code> than <code>reshape</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(tensor2d.view(3, 2))
</pre>
</div>

<pre class="example">
tensor([[1, 2],
        [3, 4],
        [5, 6]])
</pre>


<p>
Transpose
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(tensor2d.T)
</pre>
</div>

<pre class="example">
tensor([[1, 4],
        [2, 5],
        [3, 6]])
</pre>



<p>
Matrix multiplication is usually handled with <code>matmul</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(tensor2d.matmul(tensor2d.T))
</pre>
</div>

<pre class="example">
tensor([[14, 32],
        [32, 77]])
</pre>


<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(tensor2d @ tensor2d.T)
</pre>
</div>

<pre class="example">
tensor([[14, 32],
        [32, 77]])
</pre>
</div>
</div>
</div>
