content/notes/20240330-raschka-torch-notes.org
* A.3 Models as Computational Graphs

The previous section covered PyTorch's tensor library. This section gets into its automatic differentiation engine (autograd). Autograd provides functions for automatically computing gradients in dynamic computational graphs.

So what's a computational graph? It lays out the sequence of calculations needed to compute the gradients for backprop. We'll go through an example showing the forward pass of a logstic regression classifier.

#+begin_src python :session appA :results output
import torch.nn.functional as F

y = torch.tensor([1.0])
x1 = torch.tensor([1.1])
w1 = torch.tensor([2.2])
b = torch.tensor([0.0])

z = x1 * w1 + b
a = torch.sigmoid(z)

loss = F.binary_cross_entropy(a,y)
#+end_src

#+RESULTS:


This results in a computational graph which PyTorch builds in the background.

Input and weight -> (u = w_1 * x_1) -> +b -> (z = u + b) -> (a = \sigma(z)) -> loss = L(a,y) <- y
* A.4 Automatic Differentiation
PyTorch will automatically build such a graph if one of its terminal nodes has the ~requires_grad~ attribute set to True. This enables us to train neural nets via backpropagation. Working backward from the above:

\begin{align*}
\frac{\partial L}{\partial w_1} &= \frac{\partial u}{\partial w_1} \times \frac{\partial z}{\partial u} \times \frac{\partial a}{\partial z} \times \frac{\partial L}{\partial a} \\
\frac{\partial L}{\partial b} &= \frac{\partial z}{\partial b} \times \frac{\partial a}{\partial z} \times \frac{\partial L}{\partial a}
\end{align*}

Basically--apply the chain rule right to left.

Quick reminder of some definitions:
- a partial derivative measures the rate at which a function changes w/r/t one of its variables 
- a gradient is a vector of all the partial derivatives of a multivariate function

So what exactly does this have to do with torch as an autograd engine? PyTorch tracks every operation performed on tensors and can, therefore, construct a computational graph in the background. Then it cal cann on the ~grad~ function to compute the gradient of the loss w/r/t the model parameter as follows:

#+begin_src python :session appA :results output
import torch.nn.functional as F
from torch.autograd import grad

y = torch.tensor([1.0])
x1 = torch.tensor([1.1])
w1 = torch.tensor([2.2], requires_grad=True)
b = torch.tensor([0.0], requires_grad=True)

z = x1 * w1 + b
a = torch.sigmoid(z)

loss = F.binary_cross_entropy(a, y)
grad_L_w1 = grad(loss, w1, retain_graph=True) #A
grad_L_b = grad(loss, b, retain_graph=True)
#+end_src

#+RESULTS:

#+begin_src python :session appA :results output
print(grad_L_w1)
print(grad_L_b)
#+end_src

#+RESULTS:
: (tensor([-0.0898]),)
: (tensor([-0.0817]),)

We seldom manually call the grad function. We usually call ~.backward~ on the loss, which computes the gradients of all the leaf nodes in the graph, which will be stored via the ~.grad~ attributes of the tensors.


#+begin_src python :session appA :results output
print(loss.backward())
print(w1.grad)
print(b.grad)
#+end_src

#+RESULTS:
: None
: tensor([-0.0898])
: tensor([-0.0817])
