notes/20240330-raschka-torch-notes.html
<div id="outline-container-org970cf37" class="outline-2">
<h2 id="org970cf37">A.3 Models as Computational Graphs</h2>
<div class="outline-text-2" id="text-org970cf37">
<p>
The previous section covered PyTorch's tensor library. This section gets into its automatic differentiation engine (autograd). Autograd provides functions for automatically computing gradients in dynamic computational graphs.
</p>

<p>
So what's a computational graph? It lays out the sequence of calculations needed to compute the gradients for backprop. We'll go through an example showing the forward pass of a logstic regression classifier.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> torch.nn.functional <span class="org-keyword">as</span> F

<span class="org-variable-name">y</span> <span class="org-operator">=</span> torch.tensor([1.0])
<span class="org-variable-name">x1</span> <span class="org-operator">=</span> torch.tensor([1.1])
<span class="org-variable-name">w1</span> <span class="org-operator">=</span> torch.tensor([2.2])
<span class="org-variable-name">b</span> <span class="org-operator">=</span> torch.tensor([0.0])

<span class="org-variable-name">z</span> <span class="org-operator">=</span> x1 <span class="org-operator">*</span> w1 <span class="org-operator">+</span> b
<span class="org-variable-name">a</span> <span class="org-operator">=</span> torch.sigmoid(z)

<span class="org-variable-name">loss</span> <span class="org-operator">=</span> F.binary_cross_entropy(a,y)
</pre>
</div>

<p>
This results in a computational graph which PyTorch builds in the background.
</p>

<p>
Input and weight -&gt; (u = w<sub>1</sub> * x<sub>1</sub>) -&gt; +b -&gt; (z = u + b) -&gt; (a = &sigma;(z)) -&gt; loss = L(a,y) &lt;- y
</p>
</div>
</div>
<div id="outline-container-orge0faaad" class="outline-2">
<h2 id="orge0faaad">A.4 Automatic Differentiation</h2>
<div class="outline-text-2" id="text-orge0faaad">
<p>
PyTorch will automatically build such a graph if one of its terminal nodes has the <code>requires_grad</code> attribute set to True. This enables us to train neural nets via backpropagation. Working backward from the above:
</p>

\begin{align*}
\frac{\partial L}{\partial w_1} &= \frac{\partial u}{\partial w_1} \times \frac{\partial z}{\partial u} \times \frac{\partial a}{\partial z} \times \frac{\partial L}{\partial a} \\
\frac{\partial L}{\partial b} &= \frac{\partial z}{\partial b} \times \frac{\partial a}{\partial z} \times \frac{\partial L}{\partial a}
\end{align*}

<p>
Basically&#x2013;apply the chain rule right to left.
</p>

<p>
Quick reminder of some definitions:
</p>
<ul class="org-ul">
<li>a partial derivative measures the rate at which a function changes w/r/t one of its variables</li>
<li>a gradient is a vector of all the partial derivatives of a multivariate function</li>
</ul>

<p>
So what exactly does this have to do with torch as an autograd engine? PyTorch tracks every operation performed on tensors and can, therefore, construct a computational graph in the background. Then it cal cann on the <code>grad</code> function to compute the gradient of the loss w/r/t the model parameter as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> torch.nn.functional <span class="org-keyword">as</span> F
<span class="org-keyword">from</span> torch.autograd <span class="org-keyword">import</span> grad

<span class="org-variable-name">y</span> <span class="org-operator">=</span> torch.tensor([1.0])
<span class="org-variable-name">x1</span> <span class="org-operator">=</span> torch.tensor([1.1])
<span class="org-variable-name">w1</span> <span class="org-operator">=</span> torch.tensor([2.2], requires_grad<span class="org-operator">=</span><span class="org-constant">True</span>)
<span class="org-variable-name">b</span> <span class="org-operator">=</span> torch.tensor([0.0], requires_grad<span class="org-operator">=</span><span class="org-constant">True</span>)

<span class="org-variable-name">z</span> <span class="org-operator">=</span> x1 <span class="org-operator">*</span> w1 <span class="org-operator">+</span> b
<span class="org-variable-name">a</span> <span class="org-operator">=</span> torch.sigmoid(z)

<span class="org-variable-name">loss</span> <span class="org-operator">=</span> F.binary_cross_entropy(a, y)
<span class="org-variable-name">grad_L_w1</span> <span class="org-operator">=</span> grad(loss, w1, retain_graph<span class="org-operator">=</span><span class="org-constant">True</span>) <span class="org-comment-delimiter">#</span><span class="org-comment">A
</span><span class="org-variable-name">grad_L_b</span> <span class="org-operator">=</span> grad(loss, b, retain_graph<span class="org-operator">=</span><span class="org-constant">True</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(grad_L_w1)
<span class="org-builtin">print</span>(grad_L_b)
</pre>
</div>

<pre class="example">
(tensor([-0.0898]),)
(tensor([-0.0817]),)
</pre>


<p>
We seldom manually call the grad function. We usually call <code>.backward</code> on the loss, which computes the gradients of all the leaf nodes in the graph, which will be stored via the <code>.grad</code> attributes of the tensors.
</p>


<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(loss.backward())
<span class="org-builtin">print</span>(w1.grad)
<span class="org-builtin">print</span>(b.grad)
</pre>
</div>

<pre class="example">
None
tensor([-0.0898])
tensor([-0.0817])
</pre>
</div>
</div>
