content/notes/20240330-raschka-torch-notes.org
* A.5 Implementing multilayer neural networks
Now we get to the third major component of Pytorch: its library for implementing deep neural networks.

We will focus on a fully-connected MLP. To implement an NN in PyTorch, we:
- subclass the ~torch.nn.Module~ class to define a custom architecture
- define layers within the ~__init__~ constructor of the module subclass, specifying how they interact in the forward method.
- defined the forward method, which describes how data passes through the network and relates as a computational graph.

We generally do not need to implement the ~backward~ method ourselves.

Here is code illustrating a basic NN with two hidden layers.


#+begin_src python :session appA :results output
class NeuralNetwork(torch.nn.Module):
    def __init__(self, num_inputs, num_outputs):
        super().__init__()

        self.layers = torch.nn.Sequential(
            # 1st hidden layer
            torch.nn.Linear(num_inputs, 30),
            torch.nn.ReLU(),
            # 2nd hidden layer
            torch.nn.Linear(30, 20),
            torch.nn.ReLU(),
            # output layer
            torch.nn.Linear(20, num_outputs),
        )

    def forward(self, x):
        logits = self.layers(x)
        return logits
#+end_src

#+RESULTS:


We can instantiate this with 50 inputs and 3 outputs.

#+begin_src python :session appA :results output
model = NeuralNetwork(50, 3)
print(model)
#+end_src

#+RESULTS:
: NeuralNetwork(
:   (layers): Sequential(
:     (0): Linear(in_features=50, out_features=30, bias=True)
:     (1): ReLU()
:     (2): Linear(in_features=30, out_features=20, bias=True)
:     (3): ReLU()
:     (4): Linear(in_features=20, out_features=3, bias=True)
:   )
: )

We can count the total number of trainable parameters as follows:

#+begin_src python :session appA :results output
num_params = sum(p.numel() for p in model.parameters() if p.requires_grad)
print("Total number of trainable model parameters:", num_params)
#+end_src

#+RESULTS:
: Total number of trainable model parameters: 2213

A parameter is /trainable/ if its ~requires_grad~ attribute is ~True~. We can investigate specific layers. Let's look at the first linear layer.

#+begin_src python :session appA :results output
print(model.layers[0].weight)
#+end_src

#+RESULTS:
: Parameter containing:
: tensor([[-0.0844,  0.0863,  0.1168,  ...,  0.0203, -0.0814, -0.0504],
:         [ 0.0288,  0.0004, -0.1411,  ..., -0.0322, -0.1085,  0.0682],
:         [-0.1075, -0.0173, -0.0476,  ..., -0.0684, -0.0522, -0.1316],
:         ...,
:         [ 0.1129, -0.0639, -0.0662,  ...,  0.1284, -0.0707,  0.1090],
:         [ 0.0790, -0.1206, -0.1156,  ...,  0.1393, -0.0233,  0.1035],
:         [-0.0078, -0.0789,  0.0931,  ...,  0.0220, -0.0572,  0.1112]],
:        requires_grad=True)

This is truncated, so let's look at the shape instead to make sure it matches with our expectations.

#+begin_src python :session appA :results output
from rich import print

print(model.layers[0].weight.shape)
#+end_src

#+RESULTS:
: torch.Size([30, 50])

We can call on the model like this:

#+begin_src python :session appA :results output
X = torch.rand((1,50))
out = model(X)
print(out)
#+end_src

#+RESULTS:
: tensor([[ 0.0623, -0.0063, -0.1485]], grad_fn=<AddmmBackward0>)

We generated a single random example (50 dimensions) and passed it to the model. This was the /forward pass/. The forward pass simply means calculating the output tensors from the input tensors.

As we can see from the ~grad_fn~, this forward pass computes a computational graph for backprop. This can be wasteful and unnecessary if we're just interested in inference. We use the ~torch.no_grad~ context manager to get around this.

#+begin_src python :session appA :results output
with torch.no_grad():
    out = model(X)
print(out)
#+end_src

#+RESULTS:
: tensor([[ 0.0623, -0.0063, -0.1485]])

And this approach just computes the output tensors.

Usually in PyTorch we don't pass the final layer to a nonlinear activation function, because the loss function usually combines softmax with negativel og-likelihood loss in a single class. We have to call softmax explicitly if we want class-membership probabilities.

#+begin_src python :session appA :results output
with torch.no_grad():
    out = torch.softmax(model(X), dim=1)
print(out)
#+end_src

#+RESULTS:
: tensor([[0.3645, 0.3403, 0.2952]])

