notes/20240330-raschka-torch-notes.html
<div id="outline-container-orged4dbdc" class="outline-2">
<h2 id="orged4dbdc">A.5 Implementing multilayer neural networks</h2>
<div class="outline-text-2" id="text-orged4dbdc">
<p>
Now we get to the third major component of Pytorch: its library for implementing deep neural networks.
</p>

<p>
We will focus on a fully-connected MLP. To implement an NN in PyTorch, we:
</p>
<ul class="org-ul">
<li>subclass the <code>torch.nn.Module</code> class to define a custom architecture</li>
<li>define layers within the <code>__init__</code> constructor of the module subclass, specifying how they interact in the forward method.</li>
<li>defined the forward method, which describes how data passes through the network and relates as a computational graph.</li>
</ul>

<p>
We generally do not need to implement the <code>backward</code> method ourselves.
</p>

<p>
Here is code illustrating a basic NN with two hidden layers.
</p>


<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">class</span> <span class="org-type">NeuralNetwork</span>(torch.nn.Module):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, num_inputs, num_outputs):
        <span class="org-builtin">super</span>().__init__()

        <span class="org-keyword">self</span>.<span class="org-variable-name">layers</span> <span class="org-operator">=</span> torch.nn.Sequential(
            <span class="org-comment-delimiter"># </span><span class="org-comment">1st hidden layer
</span>            torch.nn.Linear(num_inputs, 30),
            torch.nn.ReLU(),
            <span class="org-comment-delimiter"># </span><span class="org-comment">2nd hidden layer
</span>            torch.nn.Linear(30, 20),
            torch.nn.ReLU(),
            <span class="org-comment-delimiter"># </span><span class="org-comment">output layer
</span>            torch.nn.Linear(20, num_outputs),
        )

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x):
        <span class="org-variable-name">logits</span> <span class="org-operator">=</span> <span class="org-keyword">self</span>.layers(x)
        <span class="org-keyword">return</span> logits
</pre>
</div>

<p>
We can instantiate this with 50 inputs and 3 outputs.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">model</span> <span class="org-operator">=</span> NeuralNetwork(50, 3)
<span class="org-builtin">print</span>(model)
</pre>
</div>

<pre class="example">
NeuralNetwork(
  (layers): Sequential(
    (0): Linear(in_features=50, out_features=30, bias=True)
    (1): ReLU()
    (2): Linear(in_features=30, out_features=20, bias=True)
    (3): ReLU()
    (4): Linear(in_features=20, out_features=3, bias=True)
  )
)
</pre>


<p>
We can count the total number of trainable parameters as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">num_params</span> <span class="org-operator">=</span> <span class="org-builtin">sum</span>(p.numel() <span class="org-keyword">for</span> p <span class="org-keyword">in</span> model.parameters() <span class="org-keyword">if</span> p.requires_grad)
<span class="org-builtin">print</span>(<span class="org-string">"Total number of trainable model parameters:"</span>, num_params)
</pre>
</div>

<pre class="example">
Total number of trainable model parameters: 2213
</pre>


<p>
A parameter is <i>trainable</i> if its <code>requires_grad</code> attribute is <code>True</code>. We can investigate specific layers. Let's look at the first linear layer.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(model.layers[0].weight)
</pre>
</div>

<pre class="example">
Parameter containing:
tensor([[-0.0844,  0.0863,  0.1168,  ...,  0.0203, -0.0814, -0.0504],
        [ 0.0288,  0.0004, -0.1411,  ..., -0.0322, -0.1085,  0.0682],
        [-0.1075, -0.0173, -0.0476,  ..., -0.0684, -0.0522, -0.1316],
        ...,
        [ 0.1129, -0.0639, -0.0662,  ...,  0.1284, -0.0707,  0.1090],
        [ 0.0790, -0.1206, -0.1156,  ...,  0.1393, -0.0233,  0.1035],
        [-0.0078, -0.0789,  0.0931,  ...,  0.0220, -0.0572,  0.1112]],
       requires_grad=True)
</pre>


<p>
This is truncated, so let's look at the shape instead to make sure it matches with our expectations.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> rich <span class="org-keyword">import</span> <span class="org-builtin">print</span>

<span class="org-builtin">print</span>(model.layers[0].weight.shape)
</pre>
</div>

<pre class="example">
torch.Size([30, 50])
</pre>


<p>
We can call on the model like this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">X</span> <span class="org-operator">=</span> torch.rand((1,50))
<span class="org-variable-name">out</span> <span class="org-operator">=</span> model(X)
<span class="org-builtin">print</span>(out)
</pre>
</div>

<pre class="example">
tensor([[ 0.0623, -0.0063, -0.1485]], grad_fn=&lt;AddmmBackward0&gt;)
</pre>


<p>
We generated a single random example (50 dimensions) and passed it to the model. This was the <i>forward pass</i>. The forward pass simply means calculating the output tensors from the input tensors.
</p>

<p>
As we can see from the <code>grad_fn</code>, this forward pass computes a computational graph for backprop. This can be wasteful and unnecessary if we're just interested in inference. We use the <code>torch.no_grad</code> context manager to get around this.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">with</span> torch.no_grad():
    <span class="org-variable-name">out</span> <span class="org-operator">=</span> model(X)
<span class="org-builtin">print</span>(out)
</pre>
</div>

<pre class="example">
tensor([[ 0.0623, -0.0063, -0.1485]])
</pre>


<p>
And this approach just computes the output tensors.
</p>

<p>
Usually in PyTorch we don't pass the final layer to a nonlinear activation function, because the loss function usually combines softmax with negativel og-likelihood loss in a single class. We have to call softmax explicitly if we want class-membership probabilities.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">with</span> torch.no_grad():
    <span class="org-variable-name">out</span> <span class="org-operator">=</span> torch.softmax(model(X), dim<span class="org-operator">=</span>1)
<span class="org-builtin">print</span>(out)
</pre>
</div>

<pre class="example">
tensor([[0.3645, 0.3403, 0.2952]])
</pre>
</div>
</div>
