notes/20240330-raschka-torch-notes.html

<div id="outline-container-org49fd392" class="outline-2">
<h2 id="org49fd392">A.6 Setting up efficient data loaders</h2>
<div class="outline-text-2" id="text-org49fd392">
<p>
A <code>DataSet</code> is a class that defines how individual records are loaded. A <code>DataLoader</code> class handles dataset shuffling and assembling data records into batches.
</p>

<p>
This example shows a dataset of five training examples with two features each, along with a tensor of class labels. We also have a test dataset of two entries.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">X_train</span> <span class="org-operator">=</span> torch.tensor(
    [[<span class="org-operator">-</span>1.2, 3.1], [<span class="org-operator">-</span>0.9, 2.9], [<span class="org-operator">-</span>0.5, 2.6], [2.3, <span class="org-operator">-</span>1.1], [2.7, <span class="org-operator">-</span>1.5]]
)
<span class="org-variable-name">y_train</span> <span class="org-operator">=</span> torch.tensor([0, 0, 0, 1, 1])
<span class="org-variable-name">X_test</span> <span class="org-operator">=</span> torch.tensor(
    [
        [<span class="org-operator">-</span>0.8, 2.8],
        [2.6, <span class="org-operator">-</span>1.6],
    ]
)
<span class="org-variable-name">y_test</span> <span class="org-operator">=</span> torch.tensor([0, 1])
</pre>
</div>

<p>
Let's first make these into a <code>DataSet</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> torch.utils.data <span class="org-keyword">import</span> Dataset

<span class="org-keyword">class</span> <span class="org-type">ToyDataset</span>(Dataset):
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, X, y):
        <span class="org-keyword">self</span>.<span class="org-variable-name">features</span> <span class="org-operator">=</span> X
        <span class="org-keyword">self</span>.<span class="org-variable-name">labels</span> <span class="org-operator">=</span> y

    <span class="org-keyword">def</span> <span class="org-function-name">__getitem__</span>(<span class="org-keyword">self</span>, index):
        <span class="org-variable-name">one_x</span> <span class="org-operator">=</span> <span class="org-keyword">self</span>.features[index]
        <span class="org-variable-name">one_y</span> <span class="org-operator">=</span> <span class="org-keyword">self</span>.labels[index]
        <span class="org-keyword">return</span> one_x, one_y

    <span class="org-keyword">def</span> <span class="org-function-name">__len__</span>(<span class="org-keyword">self</span>):
        <span class="org-keyword">return</span> <span class="org-keyword">self</span>.labels.shape[0]

<span class="org-variable-name">train_ds</span> <span class="org-operator">=</span> ToyDataset(X_train, y_train)
<span class="org-variable-name">test_ds</span> <span class="org-operator">=</span> ToyDataset(X_test, y_test)
</pre>
</div>


<p>
Note the three main components of the above Dataset definition:
</p>
<ol class="org-ol">
<li><code>__init__</code>, to set up attributes we can access in the other methods. This might be file paths, file objects, database connectors, etc. Here we just use X and y, which we point toward the correct tensor objects in memory.</li>
<li><code>__getitem__</code> is for defining instructions for retrieving exactly one record via <code>index</code>.</li>
<li><p>
<code>__len__</code> is for retrieving the length of the dataset.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(<span class="org-builtin">len</span>(train_ds))
</pre>
</div>

<pre class="example">
5
</pre></li>
</ol>

<p>
Now we can use the <code>DataLoader</code> class to define how to sample from the Dataset we defined.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">from</span> torch.utils.data <span class="org-keyword">import</span> DataLoader

torch.manual_seed(123)

<span class="org-variable-name">train_loader</span> <span class="org-operator">=</span> DataLoader(
    dataset<span class="org-operator">=</span>train_ds,
    batch_size<span class="org-operator">=</span>2,
    shuffle<span class="org-operator">=</span><span class="org-constant">True</span>,
    num_workers<span class="org-operator">=</span>0
    )

<span class="org-variable-name">test_loader</span> <span class="org-operator">=</span> DataLoader(
    dataset<span class="org-operator">=</span>test_ds,
    batch_size<span class="org-operator">=</span>2,
    shuffle<span class="org-operator">=</span><span class="org-constant">False</span>,
    num_workers<span class="org-operator">=</span>0
    )
</pre>
</div>

<p>
Now we can iterate over the <code>train_loader</code> as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">for</span> idx, (x, y) <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(train_loader):
    <span class="org-builtin">print</span>(f<span class="org-string">"Batch </span>{idx<span class="org-operator">+</span>1}<span class="org-string">:"</span>, x, y)
</pre>
</div>

<pre class="example">
Batch 1: tensor([[ 2.3000, -1.1000],
        [-0.9000,  2.9000]]) tensor([1, 0])

Batch 2: tensor([[-1.2000,  3.1000],
        [-0.5000,  2.6000]]) tensor([0, 0])

Batch 3: tensor([[ 2.7000, -1.5000]]) tensor([1])
</pre>


<p>
Note that we can set <code>drop_last=True</code> to drop the last uneven batch, as significantly uneven batch sizes can harm convergence.
</p>

<p>
The <code>num_workers</code> argument relates to parallelizing data loading/processing. 0 indicates that it will all be done in the main process, not in separate worker processes. This can slow things down a lot.
</p>
</div>
</div>
