notes/20240330-raschka-torch-notes.html

<div id="outline-container-org1774662" class="outline-2">
<h2 id="org1774662">A.7 A typical training loop</h2>
<div class="outline-text-2" id="text-org1774662">
<p>
In this section, we combine many of the techniques from above to show a complete training loop.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> torch
<span class="org-keyword">import</span> torch.nn.functional <span class="org-keyword">as</span> F
 
 
torch.manual_seed(123)
<span class="org-variable-name">model</span> <span class="org-operator">=</span> NeuralNetwork(num_inputs<span class="org-operator">=</span>2, num_outputs<span class="org-operator">=</span>2)
<span class="org-variable-name">optimizer</span> <span class="org-operator">=</span> torch.optim.SGD(model.parameters(), lr<span class="org-operator">=</span>0.5)
 
<span class="org-variable-name">num_epochs</span> <span class="org-operator">=</span> 3
 
<span class="org-keyword">for</span> epoch <span class="org-keyword">in</span> <span class="org-builtin">range</span>(num_epochs): 
    
    model.train()
    <span class="org-keyword">for</span> batch_idx, (features, labels) <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(train_loader):
 
        <span class="org-variable-name">logits</span> <span class="org-operator">=</span> model(features)
        
        <span class="org-variable-name">loss</span> <span class="org-operator">=</span> F.cross_entropy(logits, labels)
        
        optimizer.zero_grad()
        loss.backward()
        optimizer.step()
    
        <span class="org-comment-delimiter">### </span><span class="org-comment">LOGGING
</span>        <span class="org-builtin">print</span>(f<span class="org-string">"Epoch: </span>{epoch<span class="org-operator">+</span>1:03d}<span class="org-string">/</span>{num_epochs:03d}<span class="org-string">"</span>
              f<span class="org-string">" | Batch </span>{batch_idx:03d}<span class="org-string">/</span>{<span class="org-builtin">len</span>(train_loader):03d}<span class="org-string">"</span>
              f<span class="org-string">" | Train Loss: </span>{loss:.2f}<span class="org-string">"</span>)
 
    model.<span class="org-builtin">eval</span>()
    <span class="org-comment-delimiter"># </span><span class="org-comment">Optional model evaluation</span>
</pre>
</div>

<pre class="example">
Epoch: 001/003 | Batch 000/003 | Train Loss: 0.75
Epoch: 001/003 | Batch 001/003 | Train Loss: 0.65
Epoch: 001/003 | Batch 002/003 | Train Loss: 0.42
Epoch: 002/003 | Batch 000/003 | Train Loss: 0.05
Epoch: 002/003 | Batch 001/003 | Train Loss: 0.13
Epoch: 002/003 | Batch 002/003 | Train Loss: 0.00
Epoch: 003/003 | Batch 000/003 | Train Loss: 0.01
Epoch: 003/003 | Batch 001/003 | Train Loss: 0.00
Epoch: 003/003 | Batch 002/003 | Train Loss: 0.02
</pre>



<p>
Note the use of <code>model.train</code> and <code>model.eval</code>. These set the model into training and evaluation mode, respectively. Some components behave differently during training or inference, such as ddropout or batch normalization. We don't have these or anything like them, so this is redundant in our code, but still good practice.
</p>

<p>
We pass the logits directly to <code>cross_entropy</code> to compute the loss and call <code>loss.backward()</code> to compute gradients. <code>optimizer.step</code> uses the gradients to update the model parameters.
</p>

<p>
It is important that we include an <code>optimizer.zero_grad</code> call in each update to reset the gradients and ensure they do not accumulate.
</p>

<p>
Now we can make predictions with the model.
</p>

<div class="org-src-container">
<pre class="src src-python">model.<span class="org-builtin">eval</span>()
<span class="org-keyword">with</span> torch.no_grad():
    <span class="org-variable-name">outputs</span> <span class="org-operator">=</span> model(X_train)
<span class="org-builtin">print</span>(outputs)
</pre>
</div>

<pre class="example">
tensor([[ 2.9320, -4.2563],
        [ 2.6045, -3.8389],
        [ 2.1484, -3.2514],
        [-2.1461,  2.1496],
        [-2.5004,  2.5210]])
</pre>


<p>
If we want the class membership, we can obtain it with:
</p>

<div class="org-src-container">
<pre class="src src-python">torch.set_printoptions(sci_mode<span class="org-operator">=</span><span class="org-constant">False</span>)
<span class="org-variable-name">probas</span> <span class="org-operator">=</span> torch.softmax(outputs, dim<span class="org-operator">=</span>1)
<span class="org-builtin">print</span>(probas)
</pre>
</div>

<pre class="example">
tensor([[    0.9992,     0.0008],
        [    0.9984,     0.0016],
        [    0.9955,     0.0045],
        [    0.0134,     0.9866],
        [    0.0066,     0.9934]])
</pre>


<p>
There are two classes, so the above represents the probabilities of belonging to class 1 or class 2. The first three have high probability of class 1; the last two of class 2.
</p>

<p>
We can convery into class labels as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">predictions</span> <span class="org-operator">=</span> torch.argmax(probas, dim<span class="org-operator">=</span>1)
<span class="org-builtin">print</span>(predictions)
</pre>
</div>

<pre class="example">
tensor([0, 0, 0, 1, 1])
</pre>


<p>
We don't need to compute softmax probabilities to accomplish this.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(torch.argmax(outputs, dim<span class="org-operator">=</span>1))
</pre>
</div>

<pre class="example">
tensor([0, 0, 0, 1, 1])
</pre>


<p>
Is it correct?
</p>

<div class="org-src-container">
<pre class="src src-python">predictions <span class="org-operator">==</span> y_train
</pre>
</div>

<pre class="example">
tensor([True, True, True, True, True])
</pre>


<p>
and to get the proportion correct:
</p>
<div class="org-src-container">
<pre class="src src-python">torch.<span class="org-builtin">sum</span>(predictions <span class="org-operator">==</span> y_train) <span class="org-operator">/</span> <span class="org-builtin">len</span>(y_train)
</pre>
</div>

<pre class="example">
tensor(1.)
</pre>
</div>
</div>


<div id="outline-container-orge9a4fd2" class="outline-2">
<h2 id="orge9a4fd2">A.8 Saving and Loading Models</h2>
<div class="outline-text-2" id="text-orge9a4fd2">
<p>
We can save a model as follows:
</p>

<div class="org-src-container">
<pre class="src src-python">torch.save(model.state_dict(), <span class="org-string">"model.pth"</span>)
</pre>
</div>

<p>
<code>.pt</code> and <code>.pth</code> are the most common extensions, by convention, but we can use whatever we want.
</p>

<p>
We restore a model with:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">model</span> <span class="org-operator">=</span> NeuralNetwork(2,2)
model.load_state_dict(torch.load(<span class="org-string">"model.pth"</span>))
</pre>
</div>

<p>
It is necessary to have an instance of the model in memory in order to load the model weights.
</p>
</div>
</div>
<div id="outline-container-org65e9781" class="outline-2">
<h2 id="org65e9781">A.9 Optimizing training performance with GPUs</h2>
<div class="outline-text-2" id="text-org65e9781">
</div>

<div id="outline-container-orgb42ad29" class="outline-3">
<h3 id="orgb42ad29">Computations on GPUs</h3>
<div class="outline-text-3" id="text-orgb42ad29">
<ul class="org-ul">
<li>Modifying training runs to use GPU in PyTorch is easy</li>
<li>In PyTorch, a <code>device</code> is where computations occur and data resides. A pytorch tensor lives on a device and its operations are executed on that device.</li>
</ul>

<p>
Because I am running this locally, I am going to try to follow these examples with mps.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-builtin">print</span>(<span class="org-string">"MPS is available."</span> <span class="org-keyword">if</span> torch.backends.mps.is_available() <span class="org-keyword">else</span> <span class="org-string">"MPS is not available."</span>)
</pre>
</div>

<pre class="example">
MPS is available.
</pre>


<p>
By default, operations are done on CPU.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">tensor_1</span> <span class="org-operator">=</span> torch.tensor([1., 2., 3.])
<span class="org-variable-name">tensor_2</span> <span class="org-operator">=</span> torch.tensor([4., 5., 6.])
tensor_1 <span class="org-operator">+</span> tensor_2
</pre>
</div>

<pre class="example">
tensor([5., 7., 9.])
</pre>


<p>
Now we can transfer the tensors to GPU and perform the addition there.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">tensor_1</span> <span class="org-operator">=</span> tensor_1.to(<span class="org-string">"mps"</span>)
<span class="org-variable-name">tensor_2</span> <span class="org-operator">=</span> tensor_2.to(<span class="org-string">"mps"</span>)
tensor_1 <span class="org-operator">+</span> tensor_2
</pre>
</div>

<pre class="example">
tensor([5., 7., 9.], device='mps:0')
</pre>


<p>
All tensors have to be on the same device or the computation will fail.
</p>


<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">tensor_1</span> <span class="org-operator">=</span> tensor_1.to(<span class="org-string">"mps"</span>)
<span class="org-variable-name">tensor_2</span> <span class="org-operator">=</span> tensor_2.to(<span class="org-string">"cpu"</span>)
tensor_1 <span class="org-operator">+</span> tensor_2
</pre>
</div>

<pre class="example">
Traceback (most recent call last):
  File "&lt;string&gt;", line 17, in __PYTHON_EL_eval
  File "&lt;string&gt;", line 3, in &lt;module&gt;
  File "/var/folders/vq/mfrl6bsd37jglvmz0vyxf3000000gn/T/babel-YaG8HR/python-l9RkUi", line 3, in &lt;module&gt;
    tensor_1 + tensor_2
    ~~~~~~~~~^~~~~~~~~~
RuntimeError: Expected all tensors to be on the same device, but found at least two devices, mps:0 and cpu!
</pre>
</div>
</div>
