notes/20240330-raschka-torch-notes.html
<div id="outline-container-org5db4616" class="outline-3">
<h3 id="org5db4616">Single-GPU Training</h3>
<div class="outline-text-3" id="text-org5db4616">
<p>
All we need to do to train on a single GPU is:
</p>
<ul class="org-ul">
<li>set <code>device = torch.device("cuda")</code></li>
<li>set <code>model = model.to(device)</code></li>
<li>set <code>features, labels = features.to(device), labels.to(device)</code></li>
</ul>

<p>
This is usually considered the best practice:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-variable-name">device</span> <span class="org-operator">=</span> torch.device(<span class="org-string">"cuda"</span> <span class="org-keyword">if</span> torch.cuda.is_available() <span class="org-keyword">else</span> <span class="org-string">"cpu"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8121414" class="outline-3">
<h3 id="org8121414">Multi-GPU Training</h3>
<div class="outline-text-3" id="text-org8121414">
<p>
This section introduces the idea of <i>distributed training</i>.
</p>

<p>
The most basic approach uses PyTorch's <code>DistributedDataParallel</code> strategy. DDP splits inputs across available devices and processes the subsets simultaneously. How does this work?
</p>
<ul class="org-ul">
<li>PyTorch launches a separate process on each GPU</li>
<li>Each process keeps a copy of the model</li>
<li>The copies are synchronized during training. The computed gradients are averaged and synchronized during training to update the model copies.</li>
</ul>

<p>
DDP offers enhanced training speed.
</p>

<div class="notice" id="orge816769">
<p>
DDP does not function properly in interactive environments like Jupyter notebooks. DDP code must be run as a script, not within a notebook interface.
</p>

</div>


<p>
First we load the utilities:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> torch.multiprocessing <span class="org-keyword">as</span> mp
<span class="org-keyword">from</span> torch.utils.data.distributed <span class="org-keyword">import</span> DistributedSampler
<span class="org-keyword">from</span> torch.nn.parallel <span class="org-keyword">import</span> DistributedDataParallel <span class="org-keyword">as</span> DDP
<span class="org-keyword">from</span> torch.distributed <span class="org-keyword">import</span> init_process_group, destroy_process_group
</pre>
</div>


<ul class="org-ul">
<li><code>multiprocessing</code> includes various functions for spawning multiple processes and applying functions in parallel.</li>
<li><code>DistributedSampler</code> is for dividing the training data among processes.</li>
<li>The init/destroy process group functions are for starting and ending the distributed training modules.</li>
</ul>


<p>
Here is an example script for distributed training.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">ddp_setup</span>(rank, world_size):
    os.<span class="org-variable-name">environ</span>[<span class="org-string">"MASTER_ADDR"</span>] <span class="org-operator">=</span> <span class="org-string">"localhost"</span>
    os.<span class="org-variable-name">environ</span>[<span class="org-string">"MASTER_PORT"</span>] <span class="org-operator">=</span> <span class="org-string">"12345"</span>
    init_process_group(
        backend<span class="org-operator">=</span><span class="org-string">"nccl"</span>,
        rank<span class="org-operator">=</span>rank,
        world_size<span class="org-operator">=</span>world_size
    )
    torch.cuda.set_device(rank)
<span class="org-keyword">def</span> <span class="org-function-name">prepare_dataset</span>():
    ...
    <span class="org-variable-name">train_loader</span> <span class="org-operator">=</span> DataLoader(
        dataset<span class="org-operator">=</span>train_ds,
        batch_size<span class="org-operator">=</span>2,
        shuffle<span class="org-operator">=</span><span class="org-constant">False</span>,
        pin_memory<span class="org-operator">=</span><span class="org-constant">True</span>,
        drop_last<span class="org-operator">=</span><span class="org-constant">True</span>,
        <span class="org-comment-delimiter"># </span><span class="org-comment">this ensures each GPU receives different data subsample
</span>        sampler<span class="org-operator">=</span>DistributedSampler(train_ds) 
    )    
    <span class="org-keyword">return</span> train_loader, test_loader
<span class="org-keyword">def</span> <span class="org-function-name">main</span>(rank, world_size, num_epochs):      
    ddp_setup(rank, world_size)
    <span class="org-variable-name">train_loader</span>, <span class="org-variable-name">test_loader</span> <span class="org-operator">=</span> prepare_dataset()
    <span class="org-variable-name">model</span> <span class="org-operator">=</span> NeuralNetwork(num_inputs<span class="org-operator">=</span>2, num_outputs<span class="org-operator">=</span>2)
    model.to(rank)
    <span class="org-variable-name">optimizer</span> <span class="org-operator">=</span> torch.optim.SGD(model.parameters(), lr<span class="org-operator">=</span>0.5)
    <span class="org-comment-delimiter"># </span><span class="org-comment">Wrap the model in DDP to enable gradient synchronization
</span>    <span class="org-variable-name">model</span> <span class="org-operator">=</span> DDP(model, device_ids<span class="org-operator">=</span>[rank])
    <span class="org-keyword">for</span> epoch <span class="org-keyword">in</span> <span class="org-builtin">range</span>(num_epochs):
    <span class="org-keyword">for</span> features, labels <span class="org-keyword">in</span> train_loader:
            <span class="org-variable-name">features</span>, <span class="org-variable-name">labels</span> <span class="org-operator">=</span> features.to(rank), labels.to(rank) 
            ...
            <span class="org-builtin">print</span>(f<span class="org-string">"[GPU</span>{rank}<span class="org-string">] Epoch: </span>{epoch<span class="org-operator">+</span>1:03d}<span class="org-string">/</span>{num_epochs:03d}<span class="org-string">"</span>
                  f<span class="org-string">" | Batchsize </span>{labels.shape[0]:03d}<span class="org-string">"</span>
                  f<span class="org-string">" | Train/Val Loss: </span>{loss:.2f}<span class="org-string">"</span>)
    model.<span class="org-builtin">eval</span>()
    <span class="org-variable-name">train_acc</span> <span class="org-operator">=</span> compute_accuracy(model, train_loader, device<span class="org-operator">=</span>rank)
    <span class="org-builtin">print</span>(f<span class="org-string">"[GPU</span>{rank}<span class="org-string">] Training accuracy"</span>, train_acc)
    <span class="org-variable-name">test_acc</span> <span class="org-operator">=</span> compute_accuracy(model, test_loader, device<span class="org-operator">=</span>rank)
    <span class="org-builtin">print</span>(f<span class="org-string">"[GPU</span>{rank}<span class="org-string">] Test accuracy"</span>, test_acc)
    <span class="org-comment-delimiter"># </span><span class="org-comment">exit distributed training, free up resources
</span>    destroy_process_group()                   

<span class="org-keyword">if</span> <span class="org-builtin">__name__</span> <span class="org-operator">==</span> <span class="org-string">"__main__"</span>:
    <span class="org-builtin">print</span>(<span class="org-string">"Number of GPUs available:"</span>, torch.cuda.device_count())
    torch.manual_seed(123)
    <span class="org-variable-name">num_epochs</span> <span class="org-operator">=</span> 3
    <span class="org-variable-name">world_size</span> <span class="org-operator">=</span> torch.cuda.device_count()
    mp.spawn(main, args<span class="org-operator">=</span>(world_size, num_epochs), nprocs<span class="org-operator">=</span>world_size)
</pre>
</div>

<p>
If you only want to use some GPUs, set the <code>CUDA_VISIBLE_DEVICES</code> environment variable.
</p>

<pre class="example">
CUDA_VISIBLE_DIVICES=0,2 python training_script.py
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-03-31 Sun 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
